package array;

/*Создайте массив из всех чётных чисел от 2 до 20 и выведите элементы массива на экран сначала в строку, отделяя один
элемент от другого пробелом, а затем в столбик (отделяя один элемент от другого началом новой строки). Перед созданием
массива подумайте, какого он будет размера.

2 4 6 … 18 20
2
4
6
…
20

Создайте массив из всех нечётных чисел от 1 до 99, выведите его на экран в строку, а затем этот же массив выведите на
экран тоже в строку, но в обратном порядке (99 97 95 93 … 7 5 3 1).


Создайте два массива из 10 целых случайных чисел из отрезка [1;9] и третий массив из 10 действительных чисел.
Каждый элемент с i-ым индексом третьего массива должен равняться отношению элемента из первого массива с i-ым
индексом к элементу из второго массива с i-ым индексом. Вывести все три массива на экран (каждый на отдельной строке),
 затем вывести количество целых элементов в третьем массиве.

Пользователь должен указать с клавиатуры чётное положительное число, а программа должна создать массив указанного
 размера из случайных целых чисел из [-5;5] и вывести его на экран в строку. После этого программа должна определить
  и сообщить пользователю о том, сумма модулей какой половины массива больше: левой или правой, либо сообщить,
  что эти суммы модулей равны. Если пользователь введёт неподходящее число, то программа должна требовать повторного
   ввода до тех пор, пока не будет указано корректное значение.
Программа должна создать массив из 12 случайных целых чисел из отрезка [-10;10] таким образом, чтобы отрицательных
и положительных элементов там было поровну и не было нулей. При этом порядок следования элементов должен быть
случаен (т. е. не подходит вариант, когда в массиве постоянно выпадает сначала 6 положительных, а потом 6 отрицательных
 чисел или же когда элементы постоянно чередуются через один и пр.). Вывести полученный массив на экран.
Пользователь вводит с клавиатуры натуральное число большее 3, которое сохраняется в переменную n. Если пользователь
ввёл не подходящее число, то программа должна просить пользователя повторить ввод. Создать массив из n случайных
целых чисел из отрезка [0;n] и вывести его на экран. Создать второй массив только из чётных элементов первого массива,
 если они там есть, и вывести его на экран.
 *
 */
public class TaskArra3 {
}
